{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,32,32,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D1","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D2","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D2",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization2",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization3",0,0,{}],["conv2d_Conv2D4",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["add_Add1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":9,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":9,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense2",0,0]]},"keras_version":"tfjs-layers 4.2.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.2.0","convertedBy":null,"weightsManifest":[{"paths":["./my-model.weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[5,5,1,64],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[5,5,64,32],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[5,5,32,32],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[1,1,32,32],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[2048,9],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[9],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[9,9],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[9],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[32],"dtype":"float32"}]}]}